// =====================================================================================================================

// Task 1

// const obj = {
//     name: 'John',
// };
//
// function isEmpty(obj) {
//     return Object.keys(obj).length === 0;
// }
//
// console.log(isEmpty(obj));

// =====================================================================================================================

// Task 2

// const obj = {
//   first: 4,
//   second: 6,
//   third: 'name',
// };
//
// function multiplyNumeric(obj) {
//     for (let key in obj) {
//         if (typeof obj[key] === 'number') {
//             obj[key] *= 2;
//         }
//     }
// }

// console.log(multiplyNumeric(obj));

// =====================================================================================================================

// Task 3

// function readNumber() {
//     let number;
//
//     do {
//         number = prompt("Введите число", 0);
//     } while (!isFinite(number));
//
//     return number === '' || number === null ? null : Number(number);
// }
//
// console.log(readNumber());

// =====================================================================================================================

// Task 4

// function random(min, max) {
//     return min + Math.random() * (max - min);
// }

// console.log(checkSpam(1, 5));

// =====================================================================================================================

// Task 5

// function randomInteger(min, max) {
//     return Math.floor(min + Math.random() * (max - min + 1));
// }

// console.log(checkSpam(1, 5));

// =====================================================================================================================

// Task 6

// let str = 'nix';
//
// function ucFirst(str) {
//     return str.slice(0, 1).toUpperCase() + str.slice(1);
// }

// onsole.log(ucFirst(str));

// =====================================================================================================================

// Task 7

// let str = 'viagrasssssfghjk';
//
// function checkSpam(str) {
//    return str.toLowerCase().includes('viagra') || str.toLowerCase().includes('xxx');
// }
//
// console.log(checkSpam(str));

// =====================================================================================================================

// Task 8

// let str = 'some text for testing truncate function';
//
// function truncate(str, maxlength) {
//     return (str.length > maxlength) ? str.slice(0, maxlength - 3) + '...' : str;
// }
//
// console.log(truncate(str, 20));

// =====================================================================================================================

// Task 9

// let price = '$120';
//
// function extractCurrencyValue(str) {
//     return +str.slice(1);
// }
//
// console.log(extractCurrencyValue(price));

// =====================================================================================================================

// Task 10

// function sumInput() {
//     const inputs = [];
//
//     while (true) {
//         const input = prompt('Введите число');
//
//         if (isNaN(input) || input === null) break;
//
//         inputs.push(+input);
//     }
//
//     let result = 0;
//
//     for (let i = 0; i < inputs.length; i++) {
//         result += inputs[i];
//     }
//
//     return result;
// }
//
// console.log(sumInput());

// =====================================================================================================================

// Task 11

// XXXXXX

// =====================================================================================================================

// Task 12

// else в данном случае не обязательный. return confirm('Родители разрешили?'); можно вынести с него ниже. Отличий в выполнении не будет.

// =====================================================================================================================

// Task 13

// function checkAge(age) {
//     return age > 18 ? true : confirm('Родители разрешили?');
// }
//
// function checkAge(age) {
//     return (age > 18) || confirm('Родители разрешили?');
// }

// =====================================================================================================================

// Task 14

// function min(a, b) {
//     return a > b ? b : a;
// }

// =====================================================================================================================

// Task 15

// function pow() {
//     let x = +prompt('Введите число');
//     let n = +prompt('Введите степень');
//     let result = x;
//
//     if (x >= 1 && n >= 1) {
//        for (let i = 1; i < n; i++) {
//             result *= x;
//         }
//
//         return result;
//     }
// }

// console.log(pow(2, 3));

// =====================================================================================================================

// Task 16

// function ask(question, yes, no) {
//     if (confirm(question)) yes()
//     else no();
// }
//
// ask(
//     "Вы согласны?",
//     () => alert("Вы согласились."),
//     () => alert("Вы отменили выполнение.")
// );

// =====================================================================================================================

// Task 17

// let months = 0;
// let savings = 0;
// const monthlyEarn = 3000;
// const monthlySpent = 1750;
//
// while (savings < 8000) {
//     savings += monthlyEarn - monthlySpent;
//     months++;
// }
//
// console.log(months);

// =====================================================================================================================

// Task 18

// function calcNumbersSum() {
//     let sum = 0;
//
//     for (let i = 1; i <= 10; i++) {
//         let number = +prompt(`Введите число #${i}`);
//
//         if (number < 0) sum += number;
//     }
//
//     return sum;
// }
//
// console.log(calcNumbersSum());

// =====================================================================================================================

// Task 19

// Выведет 4. В js массивы - это объекты и обе переменные ссылаються на один и тот же объект.

// =====================================================================================================================

// Task 20

// const arr = ['Джаз', 'Блюз'];
//
// arr.push('Рок-н-ролл');
//
// console.log(arr.shift());
//
// arr[Math.floor(arr.length / 2)] = 'Классика';
//
// arr.unshift('Рэп', 'Регги');

// =====================================================================================================================

// Task 21

// Выведеться всё то, что лежит в массиве (так как массив = объект). This указывает на текущий контекст, т.е. мы добавили метод в объект и дальше с него вернули контекст
// этого объекта.